ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/bluetooth/esp32_ble_hid.cpp
#ifdef ESP_PLATFORM
#include <sdkconfig.h>
#endif

#if defined(CONFIG_BT_NIMBLE_ENABLED)

#include <bluetooth/esp32_ble_internal.h>

#include <host/ble_gap.h>
#include <host/ble_gatt.h>
#include <host/ble_hs_mbuf.h>
#include <services/gap/ble_svc_gap.h>
#include <services/gatt/ble_svc_gatt.h>
#include <tactility/drivers/hid_report_descriptors.h>

#include <cstring>

constexpr auto* TAG = "esp32_ble_hid";
#include <tactility/device.h>
#include <tactility/driver.h>
#include <tactility/log.h>

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"

// ---- HID device context (stored as driver data of the HID device child) ----

#include <atomic>

struct BleHidDeviceCtx {
    std::atomic<uint16_t> hid_conn_handle;
};

// ---- Module globals ----

BleHidProfile current_hid_profile = BleHidProfile::None;
uint16_t hid_appearance = 0x03C1; // Keyboard (default)
const uint8_t* active_hid_rpt_map    = nullptr;
size_t         active_hid_rpt_map_len = 0;

// GATT attribute handles — written by NimBLE via val_handle pointers below.
uint16_t hid_kb_input_handle;
uint16_t hid_consumer_input_handle;
uint16_t hid_mouse_input_handle;
uint16_t hid_gamepad_input_handle;

// ---- Static UUID objects for HID 16-bit UUIDs ----

static const ble_uuid16_t UUID16_RPT_REF    = BLE_UUID16_INIT(0x2908);
static const ble_uuid16_t UUID16_HID_INFO   = BLE_UUID16_INIT(0x2A4A);
static const ble_uuid16_t UUID16_RPT_MAP    = BLE_UUID16_INIT(0x2A4B);
static const ble_uuid16_t UUID16_HID_CTRL   = BLE_UUID16_INIT(0x2A4C);
static const ble_uuid16_t UUID16_HID_REPORT = BLE_UUID16_INIT(0x2A4D);
static const ble_uuid16_t UUID16_PROTO_MODE = BLE_UUID16_INIT(0x2A4E);
static const ble_uuid16_t UUID16_HID_SVC    = BLE_UUID16_INIT(0x1812);

static uint8_t hid_protocol_mode = 0x01; // 0x00=Boot, 0x01=Report

// ============================================================================
// Per-profile HID Report Maps
// ============================================================================
//
// Shared with esp32_usb_hid_device.cpp - see hid_report_descriptors.h for the byte tables
// (report ID scheme, per-field layout) - HID report descriptors are transport-independent
// so the same bytes apply verbatim whether carried over USB or BLE GATT.

// ---- Per-profile Report Reference descriptor data ----
// Format: {Report ID, Report Type} — Type: 1=Input, 2=Output

static const uint8_t rpt_ref_kbc_kb_in[2]  = {1, 1};
static const uint8_t rpt_ref_kbc_cs_in[2]  = {2, 1};
static const uint8_t rpt_ref_kbc_kb_out[2] = {1, 2};
static const uint8_t rpt_ref_ms_in[2]      = {1, 1};
static const uint8_t rpt_ref_kbm_kb_in[2]  = {1, 1};
static const uint8_t rpt_ref_kbm_cs_in[2]  = {2, 1};
static const uint8_t rpt_ref_kbm_ms_in[2]  = {3, 1};
static const uint8_t rpt_ref_kbm_kb_out[2] = {1, 2};
static const uint8_t rpt_ref_gp_in[2]      = {1, 1};

// ---- HID GATT callbacks ----

static int hid_dsc_access(uint16_t /*conn_handle*/, uint16_t /*attr_handle*/,
                          struct ble_gatt_access_ctxt* ctxt, void* arg) {
    if (ctxt->op == BLE_GATT_ACCESS_OP_READ_DSC) {
        const uint8_t* data = (const uint8_t*)arg;
        int rc = os_mbuf_append(ctxt->om, data, 2);
        return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
    }
    return BLE_ATT_ERR_UNLIKELY;
}

static int hid_chr_access(uint16_t /*conn_handle*/, uint16_t attr_handle,
                          struct ble_gatt_access_ctxt* ctxt, void* /*arg*/) {
    uint16_t uuid16 = ble_uuid_u16(ctxt->chr->uuid);

    switch (ctxt->op) {
        case BLE_GATT_ACCESS_OP_READ_CHR: {
            if (uuid16 == 0x2A4A) {
                static const uint8_t hid_info[4] = { 0x11, 0x01, 0x00, 0x02 };
                int rc = os_mbuf_append(ctxt->om, hid_info, sizeof(hid_info));
                return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
            }
            if (uuid16 == 0x2A4B) {
                if (active_hid_rpt_map == nullptr || active_hid_rpt_map_len == 0)
                    return BLE_ATT_ERR_UNLIKELY;
                int rc = os_mbuf_append(ctxt->om, active_hid_rpt_map, active_hid_rpt_map_len);
                return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
            }
            if (uuid16 == 0x2A4E) {
                int rc = os_mbuf_append(ctxt->om, &hid_protocol_mode, 1);
                return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
            }
            if (uuid16 == 0x2A4D) {
                static const uint8_t zeros[9] = {};
                size_t report_len = 8;
                if (attr_handle == hid_consumer_input_handle) report_len = 2;
                else if (attr_handle == hid_mouse_input_handle) report_len = 4;
                else if (attr_handle == hid_gamepad_input_handle) report_len = 9;
                int rc = os_mbuf_append(ctxt->om, zeros, report_len);
                return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
            }
            return BLE_ATT_ERR_UNLIKELY;
        }

        case BLE_GATT_ACCESS_OP_WRITE_CHR: {
            if (uuid16 == 0x2A4C) return 0; // HID Control Point — no action
            if (uuid16 == 0x2A4E) {
                if (OS_MBUF_PKTLEN(ctxt->om) >= 1) {
                    os_mbuf_copydata(ctxt->om, 0, 1, &hid_protocol_mode);
                    LOG_I(TAG, "Protocol Mode -> %u", hid_protocol_mode);
                }
                return 0;
            }
            if (uuid16 == 0x2A4D) {
                if (OS_MBUF_PKTLEN(ctxt->om) >= 1) {
                    uint8_t leds = 0;
                    os_mbuf_copydata(ctxt->om, 0, 1, &leds);
                    LOG_I(TAG, "KB LED state: 0x%02x", leds);
                }
                return 0;
            }
            return BLE_ATT_ERR_UNLIKELY;
        }

        default:
            return BLE_ATT_ERR_UNLIKELY;
    }
}

// ---- Per-profile HID descriptor arrays ----

static struct ble_gatt_dsc_def hid_kbc_kb_dscs[]  = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbc_kb_in  }, { 0 } };
static struct ble_gatt_dsc_def hid_kbc_cs_dscs[]  = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbc_cs_in  }, { 0 } };
static struct ble_gatt_dsc_def hid_kbc_out_dscs[] = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbc_kb_out }, { 0 } };
static struct ble_gatt_dsc_def hid_ms_dscs[]      = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_ms_in      }, { 0 } };
static struct ble_gatt_dsc_def hid_kbm_kb_dscs[]  = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbm_kb_in  }, { 0 } };
static struct ble_gatt_dsc_def hid_kbm_cs_dscs[]  = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbm_cs_in  }, { 0 } };
static struct ble_gatt_dsc_def hid_kbm_ms_dscs[]  = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbm_ms_in  }, { 0 } };
static struct ble_gatt_dsc_def hid_kbm_out_dscs[] = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_kbm_kb_out }, { 0 } };
static struct ble_gatt_dsc_def hid_gp_dscs[]      = { { .uuid = &UUID16_RPT_REF.u, .att_flags = BLE_ATT_F_READ, .access_cb = hid_dsc_access, .arg = (void*)rpt_ref_gp_in      }, { 0 } };

