ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/bluetooth/esp32_ble_hid.cpp
// ---- Per-profile HID characteristic arrays ----

static struct ble_gatt_chr_def hid_chars_kb_consumer[] = {
    { .uuid = &UUID16_HID_INFO.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_RPT_MAP.u,    .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_HID_CTRL.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_PROTO_MODE.u, .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbc_kb_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_kb_input_handle },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbc_cs_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_consumer_input_handle },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbc_out_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { 0 }
};

static struct ble_gatt_chr_def hid_chars_mouse[] = {
    { .uuid = &UUID16_HID_INFO.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_RPT_MAP.u,    .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_HID_CTRL.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_PROTO_MODE.u, .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_ms_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_mouse_input_handle },
    { 0 }
};

static struct ble_gatt_chr_def hid_chars_kb_mouse[] = {
    { .uuid = &UUID16_HID_INFO.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_RPT_MAP.u,    .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_HID_CTRL.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_PROTO_MODE.u, .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbm_kb_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_kb_input_handle },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbm_cs_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_consumer_input_handle },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbm_ms_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_mouse_input_handle },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_kbm_out_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { 0 }
};

static struct ble_gatt_chr_def hid_chars_gamepad[] = {
    { .uuid = &UUID16_HID_INFO.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_RPT_MAP.u,    .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ },
    { .uuid = &UUID16_HID_CTRL.u,   .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_PROTO_MODE.u, .access_cb = hid_chr_access, .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE_NO_RSP },
    { .uuid = &UUID16_HID_REPORT.u, .access_cb = hid_chr_access, .descriptors = hid_gp_dscs,
      .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_NOTIFY, .val_handle = &hid_gamepad_input_handle },
    { 0 }
};

// ---- Per-profile GATT service arrays ----

static const struct ble_gatt_svc_def gatt_svcs_none[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &NUS_SVC_UUID.u,  .characteristics = nus_chars_with_handle },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &MIDI_SVC_UUID.u, .characteristics = midi_chars },
    { 0 }
};
static const struct ble_gatt_svc_def gatt_svcs_kb_consumer[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &NUS_SVC_UUID.u,   .characteristics = nus_chars_with_handle },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &MIDI_SVC_UUID.u,  .characteristics = midi_chars },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &UUID16_HID_SVC.u, .characteristics = hid_chars_kb_consumer },
    { 0 }
};
static const struct ble_gatt_svc_def gatt_svcs_mouse[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &NUS_SVC_UUID.u,   .characteristics = nus_chars_with_handle },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &MIDI_SVC_UUID.u,  .characteristics = midi_chars },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &UUID16_HID_SVC.u, .characteristics = hid_chars_mouse },
    { 0 }
};
static const struct ble_gatt_svc_def gatt_svcs_kb_mouse[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &NUS_SVC_UUID.u,   .characteristics = nus_chars_with_handle },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &MIDI_SVC_UUID.u,  .characteristics = midi_chars },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &UUID16_HID_SVC.u, .characteristics = hid_chars_kb_mouse },
    { 0 }
};
static const struct ble_gatt_svc_def gatt_svcs_gamepad[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &NUS_SVC_UUID.u,   .characteristics = nus_chars_with_handle },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &MIDI_SVC_UUID.u,  .characteristics = midi_chars },
    { .type = BLE_GATT_SVC_TYPE_PRIMARY, .uuid = &UUID16_HID_SVC.u, .characteristics = hid_chars_gamepad },
    { 0 }
};

// ---- HID field accessor implementations ----

static BleCtx* hid_root_ctx(struct Device* device) {
    return ble_get_ctx(device);
}

bool ble_hid_get_active(struct Device* device) {
    return hid_root_ctx(device)->hid_active.load();
}
void ble_hid_set_active(struct Device* device, bool v) {
    hid_root_ctx(device)->hid_active.store(v);
}
uint16_t ble_hid_get_conn_handle(struct Device* device) {
    if (device == nullptr) return (uint16_t)BLE_HS_CONN_HANDLE_NONE;
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    return hid_ctx ? hid_ctx->hid_conn_handle.load() : (uint16_t)BLE_HS_CONN_HANDLE_NONE;
}
void ble_hid_set_conn_handle(struct Device* device, uint16_t h) {
    if (device == nullptr) return;
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx) hid_ctx->hid_conn_handle.store(h);
}

// ---- GATT profile switch ----
// device must be the HID device child Device*.

bool ble_hid_switch_profile(struct Device* device, BleHidProfile profile) {
    if (profile == current_hid_profile) return true;
    LOG_I(TAG, "switchGattProfile: %d -> %d", (int)current_hid_profile, (int)profile);

    ble_gap_adv_stop();

    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx && hid_ctx->hid_conn_handle.load() != BLE_HS_CONN_HANDLE_NONE) {
        ble_gap_terminate(hid_ctx->hid_conn_handle.load(), BLE_ERR_REM_USER_CONN_TERM);
        hid_ctx->hid_conn_handle.store(BLE_HS_CONN_HANDLE_NONE);
    }

    ble_gatts_reset();
    ble_svc_gap_init();
    ble_svc_gatt_init();

    const struct ble_gatt_svc_def* svcs = gatt_svcs_none;
    const uint8_t* new_rpt_map     = nullptr;
    size_t         new_rpt_map_len = 0;
    switch (profile) {
        case BleHidProfile::KbConsumer: svcs = gatt_svcs_kb_consumer; new_rpt_map = hid_report_map_keyboard_consumer;      new_rpt_map_len = hid_report_map_keyboard_consumer_len;      break;
        case BleHidProfile::Mouse:      svcs = gatt_svcs_mouse;        new_rpt_map = hid_report_map_mouse;                   new_rpt_map_len = hid_report_map_mouse_len;                   break;
        case BleHidProfile::KbMouse:    svcs = gatt_svcs_kb_mouse;     new_rpt_map = hid_report_map_keyboard_consumer_mouse; new_rpt_map_len = hid_report_map_keyboard_consumer_mouse_len; break;
        case BleHidProfile::Gamepad:    svcs = gatt_svcs_gamepad;      new_rpt_map = hid_report_map_gamepad;                 new_rpt_map_len = hid_report_map_gamepad_len;                 break;
        default:                        svcs = gatt_svcs_none;                                                                                                      break;
    }

    int rc = ble_gatts_count_cfg(svcs);
    if (rc == 0) {
        rc = ble_gatts_add_svcs(svcs);
        if (rc != 0) {
            LOG_E(TAG, "switchGattProfile: gatts_add_svcs failed rc=%d", rc);
            return false; // don't update profile — GATT state is inconsistent
        }
    } else {
        LOG_E(TAG, "switchGattProfile: gatts_count_cfg failed rc=%d", rc);
        return false;
    }

    // ble_gatts_add_svcs() only adds definitions to a pending list.
    // ble_gatts_start() converts them into live ATT entries.
    // Without this call, all GATT reads return ATT errors and Windows
    // cannot install the HID driver → Phase 2 reconnect never occurs.
    rc = ble_gatts_start();
    if (rc != 0) {
        LOG_E(TAG, "switchGattProfile: gatts_start failed rc=%d", rc);
        return false;
    }

    active_hid_rpt_map     = new_rpt_map;
    active_hid_rpt_map_len = new_rpt_map_len;

    ble_svc_gap_device_name_set(CONFIG_TT_DEVICE_NAME);
    ble_att_set_preferred_mtu(BLE_ATT_MTU_MAX);
    // Do NOT call ble_svc_gatt_changed(0, 0xFFFF) here.
    // switchGattProfile() is always called while disconnected (ble_gatts_mutable()
    // requires no active connection). ble_gatts_chr_updated() would persist a
    // "value_changed=1" flag in NVS for every bonded-but-disconnected peer.
    // When a bonded peer (e.g. Windows HID host) reconnects, NimBLE immediately
    // sends a Service Changed indication; Windows disconnects to re-discover GATT
    // without ACKing the indication; NimBLE re-sends on the next reconnect → loop.
    // GATT handles are deterministic (same registration order each time), so
    // bonded peers can reuse their cached handles and no indication is needed.

    current_hid_profile = profile;
    return true;
}

