ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/bluetooth/esp32_ble_hid.cpp
void ble_hid_init_gatt() {
    current_hid_profile    = BleHidProfile::None;
    active_hid_rpt_map     = nullptr;
    active_hid_rpt_map_len = 0;
    int rc = ble_gatts_count_cfg(gatt_svcs_none);
    if (rc != 0) {
        LOG_E(TAG, "gatts_count_cfg failed (rc=%d)", rc);
    } else {
        rc = ble_gatts_add_svcs(gatt_svcs_none);
        if (rc != 0) {
            LOG_E(TAG, "gatts_add_svcs failed (rc=%d)", rc);
        }
    }
}

// ---- HID Device sub-API implementations ----
// All functions receive the HID device child Device* and operate on BleHidDeviceCtx
// stored as its driver data.

static error_t hid_device_start(struct Device* device, enum BtHidDeviceMode mode) {
    // Clean up any leftover context from a previous session (e.g. BLE was disabled
    // while connected: dispatch_disable() skips the normal hid_device_stop cleanup).
    BleHidDeviceCtx* old_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    delete old_ctx; // no-op if nullptr
    // Create driver data for this HID session.
    BleHidDeviceCtx* hid_ctx = new BleHidDeviceCtx();
    hid_ctx->hid_conn_handle.store(BLE_HS_CONN_HANDLE_NONE);
    device_set_driver_data(device, hid_ctx);

    BleHidProfile profile;
    uint16_t appearance;
    switch (mode) {
        case BT_HID_DEVICE_MODE_MOUSE:
            profile    = BleHidProfile::Mouse;
            appearance = 0x03C2;
            break;
        case BT_HID_DEVICE_MODE_KEYBOARD_MOUSE:
            profile    = BleHidProfile::KbMouse;
            appearance = 0x03C0;
            break;
        case BT_HID_DEVICE_MODE_GAMEPAD:
            profile    = BleHidProfile::Gamepad;
            appearance = 0x03C4;
            break;
        default: // BT_HID_DEVICE_MODE_KEYBOARD
            profile    = BleHidProfile::KbConsumer;
            appearance = 0x03C1;
            break;
    }

    hid_appearance = appearance;
    if (!ble_hid_switch_profile(device, profile)) {
        delete (BleHidDeviceCtx*)device_get_driver_data(device);
        device_set_driver_data(device, nullptr);
        return ERROR_INVALID_STATE;
    }
    ble_hid_set_active(device, true);
    ble_start_advertising_hid(device, hid_appearance);
    return ERROR_NONE;
}

static error_t hid_device_stop(struct Device* device) {
    ble_hid_set_active(device, false);
    ble_gap_adv_stop();
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    uint16_t conn = hid_ctx ? hid_ctx->hid_conn_handle.load() : (uint16_t)BLE_HS_CONN_HANDLE_NONE;
    if (conn != BLE_HS_CONN_HANDLE_NONE) {
        // Connected: terminate and let the DISCONNECT handler switch profile to None.
        // ble_gatts_mutable() returns false while a connection is live, so calling
        // switch_profile here would assert inside ble_svc_gap_init().
        ble_gap_terminate(conn, BLE_ERR_REM_USER_CONN_TERM);
        // Do NOT clear hid_conn_handle or delete hid_ctx:
        // the DISCONNECT handler in esp32_ble.cpp uses hid_conn_handle for was_hid detection.
        // esp32_ble_hid_device_stop_device() (device lifecycle) will free hid_ctx later.
    } else {
        // Not connected: GATT is mutable, switch profile immediately.
        if (current_hid_profile != BleHidProfile::None) {
            if (!ble_hid_switch_profile(device, BleHidProfile::None)) {
                LOG_E(TAG, "hid_device_stop: switch to None failed — GATT state inconsistent");
            }
        }
        delete hid_ctx;
        device_set_driver_data(device, nullptr);
    }
    return ERROR_NONE;
}

static error_t hid_device_send_key(struct Device* device, uint8_t keycode, bool pressed) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx == nullptr || hid_ctx->hid_conn_handle.load() == BLE_HS_CONN_HANDLE_NONE) {
        return ERROR_INVALID_STATE;
    }
    uint8_t report[8] = {};
    if (pressed) report[2] = keycode;
    struct os_mbuf* om = ble_hs_mbuf_from_flat(report, sizeof(report));
    if (om == nullptr) return ERROR_INVALID_STATE;
    int rc = ble_gatts_notify_custom(hid_ctx->hid_conn_handle.load(), hid_kb_input_handle, om);
    if (rc != 0) os_mbuf_free_chain(om);
    return (rc == 0) ? ERROR_NONE : ERROR_INVALID_STATE;
}

static error_t hid_notify(uint16_t conn_handle, uint16_t attr_handle,
                           const uint8_t* data, size_t len) {
    if (conn_handle == BLE_HS_CONN_HANDLE_NONE) return ERROR_INVALID_STATE;
    if (attr_handle == 0) return ERROR_INVALID_STATE; // handle not registered for current profile
    struct os_mbuf* om = ble_hs_mbuf_from_flat(data, len);
    if (om == nullptr) return ERROR_INVALID_STATE;
    int rc = ble_gatts_notify_custom(conn_handle, attr_handle, om);
    if (rc != 0) os_mbuf_free_chain(om);
    return (rc == 0) ? ERROR_NONE : ERROR_INVALID_STATE;
}

static error_t hid_device_send_keyboard(struct Device* device, const uint8_t* report, size_t len) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx == nullptr) return ERROR_INVALID_STATE;
    uint8_t buf[8] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_notify(hid_ctx->hid_conn_handle.load(), hid_kb_input_handle, buf, sizeof(buf));
}

static error_t hid_device_send_consumer(struct Device* device, const uint8_t* report, size_t len) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx == nullptr) return ERROR_INVALID_STATE;
    uint8_t buf[2] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_notify(hid_ctx->hid_conn_handle.load(), hid_consumer_input_handle, buf, sizeof(buf));
}

static error_t hid_device_send_mouse(struct Device* device, const uint8_t* report, size_t len) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx == nullptr) return ERROR_INVALID_STATE;
    uint8_t buf[4] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_notify(hid_ctx->hid_conn_handle.load(), hid_mouse_input_handle, buf, sizeof(buf));
}

