ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/bluetooth/esp32_ble_hid.cpp
static error_t hid_device_send_gamepad(struct Device* device, const uint8_t* report, size_t len) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    if (hid_ctx == nullptr) return ERROR_INVALID_STATE;
    uint8_t buf[9] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_notify(hid_ctx->hid_conn_handle.load(), hid_gamepad_input_handle, buf, sizeof(buf));
}

static bool hid_device_is_connected(struct Device* device) {
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    return hid_ctx != nullptr && hid_ctx->hid_conn_handle.load() != BLE_HS_CONN_HANDLE_NONE;
}

extern const BtHidDeviceApi nimble_hid_device_api = {
    .start         = hid_device_start,
    .stop          = hid_device_stop,
    .send_key      = hid_device_send_key,
    .send_keyboard = hid_device_send_keyboard,
    .send_consumer = hid_device_send_consumer,
    .send_mouse    = hid_device_send_mouse,
    .send_gamepad  = hid_device_send_gamepad,
    .is_connected  = hid_device_is_connected,
};

// ---- HID device child driver lifecycle ----

static error_t esp32_ble_hid_device_stop_device(struct Device* device) {
    // Safety cleanup: free any BleHidDeviceCtx that was not deleted by hid_device_stop()
    // (e.g. if the BLE device is stopped while HID is still connected).
    BleHidDeviceCtx* hid_ctx = (BleHidDeviceCtx*)device_get_driver_data(device);
    delete hid_ctx; // safe even if nullptr
    device_set_driver_data(device, nullptr);
    return ERROR_NONE;
}

Driver esp32_ble_hid_device_driver = {
    .name         = "esp32_ble_hid_device",
    .compatible   = nullptr,
    .start_device = nullptr,
    .stop_device  = esp32_ble_hid_device_stop_device,
    .api          = &nimble_hid_device_api,
    .device_type  = &BLUETOOTH_HID_DEVICE_TYPE,
    .owner        = nullptr,
    .internal     = nullptr,
};

#pragma GCC diagnostic pop

#endif // CONFIG_BT_NIMBLE_ENABLED
